'''
每只股票的盈亏金额
全部股票的总盈亏
整体收益率（总盈亏 ÷ 总投入）
找出盈亏绝对值最大的那只股票并显示
'''

'''
赋值：初始化列表（列表内字典）


def 函数 （股票列表）
    
    赋值：持仓数量（循环增量）
    赋值：浮点：总成本价
    赋值：列表：盈亏输出
    
    for 字典 in （股票列表）
        赋值：浮点：当前盈亏= 当前盈亏* 持仓数量
        赋值：浮点：总盈亏 += 当前盈亏
        添加到盈亏输出：字符串：‘股票名={当前股票名}，盈亏={当前股票盈亏}’
        赋值：浮点：总成本价 += 当前成本价 * 持仓数量
        
        if 当前盈亏大于上一只股票的盈亏
            赋值：字符串：‘最大盈亏的股票是{当前股票名}盈亏额为{当前盈亏额}’
        else
            赋值：字符串：最大盈亏额股票 = ‘最大盈亏的股票是{当前股票名}盈亏额为{当前盈亏额}’
        
    赋值：浮点：整体收益率 = 总盈亏 / 总成本价 * 100
    
    return 盈亏输出
    return 总盈亏
    return 整体收益率
    return 最大盈亏股票
        

for 盈亏 in （函数（盈亏输出））
    打印：当前字符串
    
打印：字符串：‘总盈亏额={函数（总盈亏）}’
打印：字符串：‘总收益率={函数（总收益率）}’
打印：字符串：‘最大盈亏={函数（最大盈亏额股票）}’




'''