日程

    时间
        出发时间：8:45
        返回时间：4:30

    具体行程
        上午
            国家图书馆
        中午
            紫竹院公园
        下午
            国家图书馆

    交通
        汽车
            首选
                开车送
            备选
                打车
        地铁
            天通苑北坐 5 号线（宋家庄方向），3 站到立水桥
            换乘 13 号线（西直门方向），9 站到西直门
            换乘 4 号线大兴线（安河桥北方向），2 站到国家图书馆（A/B/C/D 口出站即达）
        步行
            看导航

具体活动内容
    图书馆内
        阅读&参观
            共同参观内容
                国家典籍博物馆
            非共同阅览内容
                13岁以上
                    总馆南北区开架阅览区
                13岁以下
                    少年儿童馆
    紫竹院公园内
        午饭
        户外活动




